{
    "name": "Hudson Ventura",
    "birth_date": "1989-04-09",
    "nick": "hudsonventura",
    "hello_message": "Hi there 👋, I'm Hudson Ventura",
    "gravatar": "https://0.gravatar.com/avatar/beab580f7f4154e904f21153ae1429dcb531257ca93f6cecb2af59c499ca93c0?size=512&d=initials",
    "role": "Full Stack Developer",
    "role2": "C# | React | PostgreSQL | GNU Linux",
    "skills": [
        {
            "name": "C# / Dotnet Core / ASP.NET",
            "icon": "https://raw.githubusercontent.com/hudsonventura/SoftExpertAPI/main/src/dotnet_logo.png",
            "description": "I have expertise in C#, Dotnet Core, and ASP.NET Core, with solid experience in developing web applications and robust APIs. I'm accustomed to working with best practices, performance, and scalability."
        },
        {
            "name": "React",
            "icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/React-icon.svg/1200px-React-icon.svg.png",
            "description": "I have good experience with React, developing modern and functional interfaces. I'm continuously learning to improve my skills with the library."
        },
        {
            "name": "PostgreSQL",
            "icon": "https://images.icon-icons.com/2415/PNG/512/postgresql_original_wordmark_logo_icon_146392.png",
            "description": "I have solid knowledge in PostgreSQL, with experience in data modeling and efficient queries. I'm still seeking to deepen my knowledge in advanced aspects of performance and administration."
        },
        {
            "name": "GNU Linux",
            "icon": "https://media.licdn.com/dms/image/C4E12AQELA0zJ-sxYxw/article-cover_image-shrink_600_2000/0/1575141578855?e=2147483647&v=beta&t=aRiIFIShe3jRnpnMkeDaEcepkWPXGwkDvjjOR7qyYNM",
            "description": "I have good experience with GNU/Linux, especially with Debian-based distributions. I'm still exploring the RHEL ecosystem and its derivatives in greater depth."
        },
        {
            "name": "Docker",
            "icon": "https://logopng.com.br/logos/docker-27.png",
            "description": "I have expertise in Docker, with experience in creating containers, defining custom images, and orchestrating isolated environments."
        },
        {
            "name": "Git",
            "icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Git_icon.svg/1200px-Git_icon.svg.png",
            "description": "Expertise in Git and GitHub, with practice in version control, branches, pull requests, and collaboration in development teams."
        },
        {
            "name": "GitHub",
            "icon": "https://logolook.net/wp-content/uploads/2022/12/GitHub-Logo.png",
            "description": "Expertise in Git and GitHub, with practice in version control, branches, pull requests, and collaboration in development teams."
        },
        {
            "name": "Python",
            "icon": "https://images.icon-icons.com/2699/PNG/512/python_logo_icon_168886.png",
            "description": "I have good experience with Python, applying the language in various automations and scripts. I'm constantly evolving to master more advanced features of the language."
        }
    ],
    "location": "Brazil",
    "english_level": "B1",
    "website": "http://hudsonventura.ddnsgeek.com",
    "linkedin": "https://www.linkedin.com/in/hudsonventura",
    "github": "https://github.com/hudsonventura",
    "nuget": "https://www.nuget.org/profiles/hudsonventura",
    "pypi": "https://pypi.org/user/hudsonventura",
    "phone": "+5565992327494",
    "email": "hudsonventura@outlook.com",
    "duolingo_username": "hudsonventura",
    "companies": [
        {
            "name": "Amaggi Exp. e Imp. LTDA",
            "roles": [
                {
                    "role": "Full Stack Developer and BPM Process Analyst",
                    "start": "2015-09-01",
                    "end": null,
                    "description": "Full stack development (Python, C#, React) and BPM process analysis with SoftExpert, automation, integrations, and continuous improvement.",
                    "description_full": "Hybrid role combining full stack development using Python, C#, and React to build robust front-end and back-end solutions. Experience with APIs, databases, automations, and system integrations. Simultaneously responsible for process analysis and modeling using the SoftExpert platform, with a focus on operational efficiency, BPMN mapping, automated flow deployment, and continuous improvement."
                },
                {
                    "role": "IT Technician",
                    "start": "2012-04-16",
                    "end": "2015-08-30",
                    "description": "Technical support, networks, formatting, legacy systems, and user and permission management in Active Directory.",
                    "description_full": "Maintenance of computers, networks, legacy systems, and operating systems. Experience with level 1 technical support, user service, formatting, workstation and peripheral configuration, and account, permission, and group management in Active Directory."
                }
            ]
        },
        {
            "name": "Ericsson Gestão e Serviços, outsourced by Vivo",
            "roles": [
                {
                    "role": "Electronics Technician",
                    "start": "2011-02-01",
                    "end": "2011-09-07",
                    "description": "Electrical maintenance on Vivo towers, inspection, UPS systems, generators, cabling, and height safety.",
                    "description_full": "Specialized in corrective and preventive electrical maintenance on telecom towers for Vivo. Involves inspection and repair of electrical panels, UPS systems, generators, grounding, and cabling. Experienced with height safety standards, electrical schematics, and continuous support of mobile and data signal operations."
                }
            ]
        },
        {
            "name": "TVCA - Centro América Television",
            "roles": [
                {
                    "role": "IT Technician",
                    "start": "2009-01-03",
                    "end": "2010-11-22",
                    "description": "Technical lead in TV: electronics maintenance, networks, servers, automation, broadcasting, AV equipment, and computers.",
                    "description_full": "Technical lead for installation and maintenance of electronic equipment, networks, and operating systems at a TV station. Worked with broadcasting infrastructure, cabling, server maintenance, automation systems support, and operation of audiovisual equipment."
                },
                {
                    "role": "IT Technical Assistant",
                    "start": "2007-01-02",
                    "end": "2009-01-02",
                    "description": "Installation and support for audio, video, and IT equipment, with supervised field technical support.",
                    "description_full": "Assisted in the installation, maintenance, and support of audio, video, and IT equipment, providing technical field support under the supervision of technicians and engineers."
                }
            ]
        }
    ],
    "education_level": "Postgraduate",
    "educations": [
        {
            "school": "UFV - Federal University of Viçosa",
            "degree": "Postgraduate Lato Sensu in Artificial Intelligence",
            "start": "2023-03-08",
            "end": "2024-04-29",
            "description": "",
            "description_full": "Specialization focused on developing intelligent solutions with an emphasis on machine learning, deep learning, natural language processing, computer vision, and predictive analysis. The program covers languages like Python, the use of frameworks like TensorFlow and PyTorch, along with practical applications in automation and data science, exclusively using Python."
        },
        {
            "school": "Faculdade Futura - Institute of Science, Education, and Technology of Votuporanga",
            "degree": "Postgraduate Lato Sensu in IT Management",
            "start": "2019-11-30",
            "end": "2021-01-05",
            "description": "",
            "description_full": "Education focused on leadership and strategic management of Information Technology, with an emphasis on governance, project management, and team management."
        },
        {
            "school": "UFMT - Federal University of Mato Grosso",
            "degree": "Postgraduate Lato Sensu in Database Management",
            "start": "2018-04-06",
            "end": "2019-11-30",
            "description": "",
            "description_full": "Specialized training in modeling, administration, and optimization of relational and non-relational databases. Covers technologies like Oracle, PostgreSQL, MongoDB, as well as topics like security, BI, performance tuning, and corporate data management."
        },
        {
            "school": "UFMT - Federal University of Mato Grosso",
            "degree": "Bachelor's Degree in Information Systems",
            "start": "2012-01-02",
            "end": "2018-03-23",
            "description": "",
            "description_full": "Solid education in software development, programming logic, data structures, and system architecture. Also includes advanced knowledge in computer networks, information security, communication protocols, and management of computational environments."
        }
    ],
    "about": [
        "Full Stack Developer using C#/ASP.Net Core and React",
        "Engaged in the development of modern, scalable, and high-performance web applications. On the backend, I build robust RESTful APIs with C# and .NET Core, integrating databases, authentication, and business logic. On the frontend, I use React to create interactive, responsive interfaces with a focus on user experience. I am familiar with DevOps practices, version control with Git, API consumption, continuous integration, and automated testing. Committed to clean code practices, design patterns, and agile methodologies.",
        "Technology enthusiast, Linux and open source. I have experience with a wide range of tools and platforms, including: Ubuntu, CentOS, Docker (Swarm and Compose), WSL2, Microsoft Active Directory/LDAP, Windows Server, NGINX, virtualization with Hyper-V, Proxmox, VirtualBox, VMWare, and Linux KVM, Oracle Cloud, Oracle Database, PostgreSQL, and Redis.",
        "In search of challenging projects. Focused on results through the improvement and automation of processes and systems. I am always eager to study new things. Given the constant changes in the computing field, I can't always delve deeply into certain subjects, but I try to at least grasp the concepts to understand which technologies can solve my problems."
    ]
}