{
    "0": "Sobre Mim",
    "1": "Contribuições (Open Source)",
    "2": "Experiências e Educação",
    "3": "Repositórios",
    "4": "Contatos",
    "5": "Imprimir",
    "6": "Entusiasta de tecnologia, Linux e open source",
    "7": "Sobre",
    "8": "min",
    "9": "Idade",
    "10": "anos",
    "11": "Educação",
    "12": "Moradia",
    "13": "Mídias Sociais",
    "14": "Contatos",
    "15": "Alguns dos meus",
    "16": "repositórios públicos",
    "17": "no Github atualizados recentemente",
    "18": "Manter repositórios públicos no GitHub é uma forma de compartilhar conhecimento, promover transparência e incentivar a colaboração. Ao expor projetos abertamente, contribuo com a comunidade, permito que outras pessoas aprendam com meu código e também recebo feedbacks valiosos. Essa prática fortalece o ecossistema open source, acelera a inovação e demonstra comprometimento com boas práticas de desenvolvimento. Meus repositórios refletem meu aprendizado contínuo, minhas experimentações e meu desejo de construir soluções que possam ser úteis para outros desenvolvedores e profissionais de tecnologia.",
    "19": "Veja minhas",
    "20": "experiências e escolaridade",
    "21": "Minhas",
    "22": "contribuições",
    "23": "Contribuo ativamente com a comunidade de desenvolvedores por meio da publicação de bibliotecas de código aberto (opensource) no PyPI e no NuGet. Essas libs foram criadas para resolver desafios reais do dia a dia e são voltadas à reutilização, produtividade e boas práticas. Compartilhar soluções em forma de pacotes públicos me permite não apenas apoiar outros desenvolvedores, mas também aprender continuamente com o feedback da comunidade e evoluir minhas próprias habilidades",
    "24": "Repositórios Públicos no Github",
    "25": "Contribuo com a comunidade Python publicando pacotes no PyPI e incentivando o compartilhamento de soluções, em apoio a comunidade Python.",
    "26": "Infelizmente o Pypi não tem uma API de contagem de downloads e pacotes 😬",
    "27": "Num total de {TOTALDOWNLOADS} downloads distribuídos entre meus {NUMPACKAGES} pacotes no NuGet, promovendo reutilização de código e contribuindo com a comunidade .NET.",
    "28": "Com {TOTALFOLOWERS} followers e mantendo {NUMREPOSITORIES} repositórios públicos, contribuindo com a comunidade e fomentando o open source",
    "29": "Pacotes Nuget | C#",
    "30": "Pacotes Pypi | Python",
    "31": "Contato",
    "32": "Experiência Profissional",
    "33": "Educação",
    "34": "Impresso em:",
    "35": "Informações",
    "36": "Nível de Inglês",
    "37": "Duolingo Progress",
    "end": "nothing"
}